In [15]:
import csv

with open("個股日成交資訊.csv",mode = "r",encoding = "utf-8",newline = "") as file:
    reader = csv.reader(file)
    data_list = list(reader)

columns_data = data_list.pop(0)
for row in data_list:
    row[2] = int(row[2].replace(',',''))
    row[3] = int(row[3].replace(',',''))
    row[4] = float(row[4].replace(',',''))
    row[5] = float(row[5].replace(',',''))
    row[6] = float(row[6].replace(',',''))
    row[7] = float(row[7].replace(',',''))
    try:
        row[8] = int(row[8].replace(',',''))
    except ValueError:
        row[8] = 0.0
    row[9] = int(row[9].replace(',',''))

In [ ]:
import pandas as pd
df = pd.DataFrame(data_list,columns = columns_data)
df.head()

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1113 entries, 0 to 1112
Data columns (total 10 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   證券代號    1113 non-null   object
 1   證券名稱    1113 non-null   object
 2   成交股數    1113 non-null   int64
 3   成交金額    1113 non-null   int64
 4   開盤價     1113 non-null   float64
 5   最高價     1113 non-null   float64
 6   最低價     1113 non-null   float64
 7   收盤價     1113 non-null   float64
 8   漲跌價差    1113 non-null   float64
 9   成交筆數    1113 non-null   int64
dtypes: float64(5), int64(3), object(2)
memory usage: 87.1+ KB

In [ ]:
df.tail()

In [ ]:
import pandas as pd
df = pd.read_csv('第一學期成績單.csv')
df

In [24]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25 entries, 0 to 24
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  25 non-null     int64
 1   國文          25 non-null     int64
 2   英文          25 non-null     int64
 3   數學          25 non-null     int64
 4   社會          25 non-null     int64
 5   自然          25 non-null     int64
 6   總分          25 non-null     int64
 7   平均          25 non-null     float64
dtypes: float64(1), int64(7)
memory usage: 1.7 KB

In [25]:
s1 = pd.Series([4.5,7.2,-5.3,3.6], index = ["d","b","a","c"])
s1.reindex(['a','b','c','d'])

a   -5.3
b    7.2
c    3.6
d    4.5
dtype: float64

In [26]:
s1.reindex(['a','b','c'])

a   -5.3
b    7.2
c    3.6
dtype: float64

In [34]:
s2 = pd.Series(['blue','yellow','red'], index = ["b","a","c"])
s2

b      blue
a    yellow
c       red
dtype: object

In [38]:
s2.drop('b')

a    yellow
c       red
dtype: object

In [57]:
import numpy as np
data = pd.DataFrame(np.arange(16).reshape(4,4),
                    index = ["台北","台中","台南","桃園"],
                    columns = ["one","two","three","four"])
data.drop(['one','two'],axis = 'columns')

    three  four
台北      2     3
台中      6     7
台南     10    11
桃園     14    15

In [44]:
s1 = pd.Series(np.arange(4.), index = ["d","b","a","c"])
s1

d    0.0
b    1.0
a    2.0
c    3.0
dtype: float64

In [47]:
#搜尋值
s1[s1 == 2.0]

a    2.0
dtype: float64

In [49]:
s1 [s1 >= 2]

a    2.0
c    3.0
dtype: float64

In [59]:
data[data['four'] < 10] = 0.0
data

    one  two  three  four
台北    0    0      0     0
台中    0    0      0     0
台南    8    9     10    11
桃園   12   13     14    15

In [64]:
data.T[data.loc['桃園'] >= 10].T

    one  two  three  four
台北    0    0      0     0
台中    0    0      0     0
台南    8    9     10    11
桃園   12   13     14    15